### 목표
- 파이썬의 데이터프레임으로 도수분포표를 만들어보자

In [1]:
# 라이브러리 import 
import pandas as pd

In [3]:
# 데이터 프레임 만들기 (딕셔너리) - 인공지능 
df_1 = pd.DataFrame(data={'진로희망': ['빅데이터분석가','자영업','웹개발자','대학원','합계'],
                         '도수': [6,7,4,3,20]})
df_1

      진로희망  도수
0  빅데이터분석가   6
1      자영업   7
2     웹개발자   4
3      대학원   3
4       합계  20

### 도수
- 빈도 수 (전체 데이터 중에서 해당하는 데이터에 갯수)

In [5]:
# 데이터 프레임 만들기 (딕셔너리) - 빅데이터 
df_2 = pd.DataFrame(data={'진로희망': ['빅데이터분석가','자영업','웹개발자','대학원','합계'],
                         '도수': [12,14,10,14,50]})
df_2

      진로희망  도수
0  빅데이터분석가  12
1      자영업  14
2     웹개발자  10
3      대학원  14
4       합계  50

In [8]:
# 빅데이터 반에 있는 도수를 가져오자 
df_col=df_2['도수']
df_col

0    12
1    14
2    10
3    14
4    50
Name: 도수, dtype: int64

In [9]:
df_1['빅데이터반']=df_col
df_1

      진로희망  도수  빅데이터반
0  빅데이터분석가   6     12
1      자영업   7     14
2     웹개발자   4     10
3      대학원   3     14
4       합계  20     50

In [10]:
df_1.set_index('진로희망',inplace=True)
df_1

         도수  빅데이터반
진로희망
빅데이터분석가   6     12
자영업       7     14
웹개발자      4     10
대학원       3     14
합계       20     50

In [11]:
df_1.columns=['인공지능반','빅데이터반']
df_1

         인공지능반  빅데이터반
진로희망
빅데이터분석가      6     12
자영업          7     14
웹개발자         4     10
대학원          3     14
합계          20     50